# "for" ციკლი (ლუპი) არის პროგრამირების ინსტრუმენტი, რომელიც საშუალებას გვაძლევს, რომ ერთსა და იმავე მოქმედება გავიმეოროთ რამდენჯერმე, მაგალითად, რიცხვების დაბეჭდვა ან რაღაცის გამეორება. "for" ციკლი განსაკუთრებით სასარგებლოა მაშინ, როდესაც ვიცით, რამდენჯერ უნდა გავიმეოროთ მოქმედება.
# საიტერაციო ცვლადი, თითოეულ მნიშვნელობას ინახავს სიის თითოეულ ელემენტზე გადასვლისას.
# პროგრამირებაში დიაპაზონი (range) არის ციფრების ან მნიშვნელობების ნაკრები, რომელიც მოიცავს მინიმალურ და მაქსიმალურ მნიშვნელობებს შორის ყველა მნიშვნელობას.



